# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3BZLX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3BZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3BZLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3BZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3X05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3X07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZHX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZLLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZLX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR3ZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBX05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZHX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZLLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZLX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4BBZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4X05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4X07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4X10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4X10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZHHX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZHHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZHX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZHX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZLLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZLX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZLX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHL7NOR4ZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNAND4X05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNAND4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR3BX05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR3BX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR3BX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR3BX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR3X05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR3X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR3X07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR3X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR3ZHX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR3ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4BBX05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4BBX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4BBX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4BBX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4X05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4X07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4X10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4X10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4ZHHX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4ZHHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4ZHX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHNOR4ZHX10]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHNOR4ZHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHON31X05]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHON31X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHON31X07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHON31X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTMH_Pss_*/TMHON31ZHX07]
# set_dont_touch [get_lib_cells RV40FTMH_Pss_*/TMHON31ZHX07]
# 
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHAN211X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHAN211X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHAN211X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHAN211X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHAN211ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHAN211ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHAN2BB11X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHAN2BB11X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHAN2BB11X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHAN2BB11X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZLLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZLX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN211ZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZLLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZLX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7AN2BB11ZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NAND4X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NAND4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NAND4ZHHX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NAND4ZHHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NAND4ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NAND4ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BX05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZLLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZLX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3BZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZLLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZLX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR3ZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBX05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZLLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZLX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4BBZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4X10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4X10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZHHX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZHHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZHX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZLLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZLLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZLX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZLX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZLX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHL7NOR4ZLX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNAND4X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNAND4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR3BX05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR3BX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR3BX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR3BX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR3X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR3X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR3X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR3X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR3ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR3ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4BBX05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4BBX05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4BBX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4BBX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4X10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4X10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4ZHHX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4ZHHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4ZHX07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHNOR4ZHX10]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHNOR4ZHX10]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHON31X05]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHON31X05]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHON31X07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHON31X07]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTLH_Pss_*/TLHON31ZHX07]
# set_dont_touch [get_lib_cells RV40FTLH_Pss_*/TLHON31ZHX07]
# 
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4X20]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4X20]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4X30]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4X30]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4X50]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4X50]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4X70]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4X70]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4X90]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4X90]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX20]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX20]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX30]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX30]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX50]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX50]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX70]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX70]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX90]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHHX90]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX20]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX20]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX30]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX30]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX50]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX50]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX70]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX70]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX90]
# set_dont_touch [get_lib_cells RV40FTHH_Pss_*/THHNOR4ZHX90]
# 
# #END -- CPU-kai1 Gaide --
# #####################
# 
# #####################
# ## set_max_transition low driver cell
# ## MA  INFO : Command remove_attribute is translated to MA_remove_attribute. (MA-001)
# MA_remove_attribute [get_lib_cells RV40FT?H_Pss_*/T?HINV*X160] dont_use
# ## MA  INFO : Command remove_attribute for attribute dont_touch is translated to set_dont_touch. (MA-042)
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/T?HINV*X160] false
# ## MA  INFO : Command remove_attribute is translated to MA_remove_attribute. (MA-001)
# MA_remove_attribute [get_lib_cells RV40FT?H_Pss_*/T?HBUF*X160] dont_use
# ## MA  INFO : Command remove_attribute for attribute dont_touch is translated to set_dont_touch. (MA-042)
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/T?HBUF*X160] false
# ### NSGK ###
# ## MA  INFO : Command remove_attribute is translated to MA_remove_attribute. (MA-001)
# MA_remove_attribute [get_lib_cells RV40FT?H_Pss_*/T?HINV*X240] dont_use
# ## MA  INFO : Command remove_attribute for attribute dont_touch is translated to set_dont_touch. (MA-042)
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/T?HINV*X240] false
# ## MA  INFO : Command remove_attribute is translated to MA_remove_attribute. (MA-001)
# MA_remove_attribute [get_lib_cells RV40FT?H_Pss_*/T?HBUF*X240] dont_use
# ## MA  INFO : Command remove_attribute for attribute dont_touch is translated to set_dont_touch. (MA-042)
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/T?HBUF*X240] false
# ## MA  INFO : Command remove_attribute is translated to MA_remove_attribute. (MA-001)
# MA_remove_attribute [get_lib_cells RV40FT?H_Pss_*/T?HINV*X320] dont_use
# ## MA  INFO : Command remove_attribute for attribute dont_touch is translated to set_dont_touch. (MA-042)
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/T?HINV*X320] false
# ## MA  INFO : Command remove_attribute is translated to MA_remove_attribute. (MA-001)
# MA_remove_attribute [get_lib_cells RV40FT?H_Pss_*/T?HBUF*X320] dont_use
# ## MA  INFO : Command remove_attribute for attribute dont_touch is translated to set_dont_touch. (MA-042)
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/T?HBUF*X320] false
# ############
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FT?H_Pss_*/*CLX*]
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/*CLX*]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FT?H_Pss_*/*HL7*]
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/*HL7*]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FT?H_Pss_*/*ZMAX*]
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/*ZMAX*]
# ## MA  INFO : Command set_dont_use is translated to MA_set_dont_use. (MA-001)
# ## MA  WARN : The command set_lib_cell_purpose must be executed after the design is read in Descartes. Please move this command if necessary. (MA-604)
# MA_set_dont_use [get_lib_cells RV40FT?H_Pss_*/*ZMBX*]
# set_dont_touch [get_lib_cells RV40FT?H_Pss_*/*ZMBX*]
# #
# #set_attribute [get_lib_pins RV40FTHH_Pss_*/*X0?/* -filter "@pin_direction == out"] max_transition 0.5
# #set_attribute [get_lib_pins RV40FTHH_Pss_*/*X1?/* -filter "@pin_direction == out"] max_transition 0.5
# #
# #set_attribute [get_lib_pins RV40FTMH_Pss_*/*X0?/* -filter "@pin_direction == out"] max_transition 0.6
# #set_attribute [get_lib_pins RV40FTMH_Pss_*/*X10/* -filter "@pin_direction == out"] max_transition 0.6
# #
# #set_attribute [get_lib_pins RV40FTLH_Pss_*/*X0?/* -filter "@pin_direction == out"] max_transition 0.65
# #set_attribute [get_lib_pins RV40FTLH_Pss_*/*X10/* -filter "@pin_direction == out"] max_transition 0.65
# #
# #####################
##PRS-MVSRC-1-END: move library cell settings from setup.tcl to cstr.tcl

##PRS-FLTSCR-END: flatten snps_scr/uhpsse2xx010_library_HMLVT.tcl

##PRS-FLTSCR-STR: flatten script/uhpsse2xx010_mw_library.tcl
# ## set mw library ##
# source -echo -verbose script/uhpsse2xx010_mw_library.tcl
##PRS-FLTSCR-SPLT: flatten script/uhpsse2xx010_mw_library.tcl
## =============================================================================
##
## created by verisyn 3.3
##
##                  VERISYN - SYNTHESIS WORK FRONT END SCRIPT
##                  -----------------------------------------
##
## This script is generated by verisyn command which support logic synthesis.
##
## -----------------------------------------------------------------------------
##       Copyright(C) 2015 Renesas Electronics Corporation. All Rights Reserved.
##
## =============================================================================

#PRS-RM-STR: remove unnecessary swithes to detect topo mode #1.
# if { [shell_is_in_topographical_mode] } {
#PRS-RM-END: remove unnecessary swithes to detect topo mode #1.

##PRS-MOD-STR: update tech file paths. Use PRS variables.
# set tech_file      ../data_masked/lib/RV40F2_6lm4x1z_VVH_HD.tf
# set tlu_plus_worst ../data_masked/lib/RV40F_DRM_6lm4x1z_typ_Tx_factor_0.9.tlup
# set tlu_plus_best  ../data_masked/lib/RV40F_DRM_6lm4x1z_typ_Tx_factor_0.9.tlup
# set map_file       ../data_masked/lib/RV40F_DRM_6lm4x1z.mapping
##PRS-MOD-SPLT: update tech file paths. Use PRS variables.
set tech_file $mw_tech_file
set tlu_plus_worst $prs_tlu_file
set tlu_plus_best $prs_mintlu_file
set map_file $prs_map_file
##PRS-MOD-END: update tech file paths. Use PRS variables.

##PRS-RM-STR: skip set mw_reference_library. This part is taken care of by PRS.
# set mw_reference_library [ list \
#   ../data_masked/mw/RV40FTHH_V02_00_00 \
#   ../data_masked/mw/RV40FTMH_V02_00_00 \
#   ../data_masked/mw/RV40FTWH_V02_00_00 \
#   ../data_masked/mw/RV40FTLH_V02_00_00 \
#   ../data_masked/mw/RV40FTHHDUMMY_V02_00_00 \
#   ../data_masked/mw/RV40FTMHDUMMY_V02_00_00 \
#   ../data_masked/mw/RV40FTLHDUMMY_V02_00_00 \
#   ../data_masked/mw/jk1502842_6lm4x1z \
# ]
##PRS-RM-END: skip set mw_reference_library. This part is taken care of by PRS.

## MA ERROR : Variable mw_logic1_net is disabled because it is not supported. (MA-272)
# set mw_logic1_net "VDD"
## MA ERROR : Variable mw_logic0_net is disabled because it is not supported. (MA-272)
# set mw_logic0_net "VSS"

##PRS-RM-STR: remove create mw lib steps. These are done by PRS flow framework.
# sh rm -rf uhpsse2xx010_MW
# set mw_design_library uhpsse2xx010_MW
# 
# create_mw_lib \
# -technology $tech_file \
# -mw_reference_library $mw_reference_library \
# $mw_design_library
# 
# open_mw_lib $mw_design_library
##PRS-RM-END: remove create mw lib steps. These are done by PRS flow framework.

##PRS-MVSRC-STR: move tlup setup from setup.tcl to cstr.tcl
# set_tlu_plus_files \
# -max_tluplus $tlu_plus_worst \
# -min_tluplus $tlu_plus_best \
# -tech2itf_map $map_file
# 
# check_tlu_plus_files
# 
# unset tech_file
# unset tlu_plus_worst
# unset tlu_plus_best
# unset map_file
##PRS-MVSRC-END: move tlup setup from setup.tcl to cstr.tcl

#PRS-RM-STR: remove unnecessary swithes to detect topo mode #2.
# }
#PRS-RM-END: remove unnecessary swithes to detect topo mode #2.
##PRS-FLTSCR-END: flatten script/uhpsse2xx010_mw_library.tcl
##PRS-MVDST-END: move from dc.tcl to setup.tcl

##PRS-MVDST-STR: move voltage group setup from dc.tcl to setup.tcl
##PRS-FLTSCR-STR: flatten snps_scr/define_threshold_voltage_group.tcl
# source -echo -verbose snps_scr/define_threshold_voltage_group.tcl
##PRS-FLTSCR-SPLT: flatten snps_scr/define_threshold_voltage_group.tcl
## MA ERROR : Attribute default_threshold_voltage_group is disabled because it is not supported. Require user translation. (MA-240)
# set_attribute [get_libs RV40FTLH_Pss_V1p1_T170_CCS_pg] default_threshold_voltage_group LVt
## MA ERROR : Attribute default_threshold_voltage_group is disabled because it is not supported. Require user translation. (MA-240)
# set_attribute [get_libs RV40FTMH_Pss_V1p1_T170_CCS_pg] default_threshold_voltage_group MVt
## MA ERROR : Attribute default_threshold_voltage_group is disabled because it is not supported. Require user translation. (MA-240)
# set_attribute [get_libs RV40FTHH_Pss_V1p1_T170_CCS_pg] default_threshold_voltage_group HVt
##PRS-FLTSCR-END: flatten snps_scr/define_threshold_voltage_group.tcl
##PRS-MVDST-STR: move voltage group setup from dc.tcl to setup.tcl

##RPS-MVDST-STR: source proc_auto_weights.tcl
source snps_scr/proc_auto_weights.tcl
##RPS-MVDST-END: source proc_auto_weights.tcl

##PRS-ADD-STR: add vth group setup
set prd_vth_groups {LVt MVt HVt}
set prd_hvth_groups {HVt}
set prd_svth_groups {MVt}
set prd_lvth_groups {LVt}

set prd_hvt_target_library {RV40FTLH_Pss_V1p1_T170_CCS_pg}
set prd_svt_target_library {RV40FTMH_Pss_V1p1_T170_CCS_pg}
set prd_lvt_target_library {RV40FTHH_Pss_V1p1_T170_CCS_pg}
##PRS-ADD-END: add vth group setup

##PRS-STAGE-END: setup
